STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/pbp_app.c
char aSourceList[SOURCE_LIST_SIZE][20] = {"STM32Auracast_1", "STM32Auracast_2", "STM32Auracast_3"};
uint8_t CurrentID = 0u;

/* Private functions prototypes-----------------------------------------------*/
static tBleStatus PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role);
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification);
static void PBPAPP_StartBroadcastAudio(Audio_Role_t role);
static tBleStatus PBPAPP_BroadcastSetupAudio(Audio_Role_t role);
static int32_t start_audio_sink(void);
/* Exported functions --------------------------------------------------------*/
extern void APP_NotifyToRun(void);

/* Functions Definition ------------------------------------------------------*/
tBleStatus APP_AUDIO_STACK_Init(void)
{
  tBleStatus status;

  /* Initialize the Audio IP*/
  BleAudioInit.NumOfLinks = CFG_BLE_NUM_LINK;
  BleAudioInit.NumOfEATTBearersPerLink = CFG_BLE_EATT_BEARER_PER_LINK;
  BleAudioInit.bleAudioStartRamAddress = (uint8_t*)aAudioInitBuffer;
  BleAudioInit.total_buffer_size = BLE_AUDIO_DYN_ALLOC_SIZE;
  BleAudioInit.MaxNumOfBondedDevices = 0;
  BleAudioInit.bleAudioStartRamAddress_NVM = 0;
  BleAudioInit.total_buffer_size_NVM = 0;
  status = BLE_AUDIO_STACK_Init(&BleAudioInit);
  LOG_INFO_APP("BLE_AUDIO_STACK_Init() returns status 0x%02X\n",status);
  LOG_INFO_APP("BLE Audio Stack Lib version: %s\n",BLE_AUDIO_STACK_GetFwVersion());

  return status;
}

/**
  * @brief  Notify CAP Events
  * @param  pNotification: pointer on notification information
 */
void CAP_Notification(CAP_Notification_Evt_t *pNotification)
{
  /* Notify PBP */
  CAP_PBP_Notification(pNotification);

  /* Notify App */
  CAP_App_Notification(pNotification);
}

/**
  * @brief  Notify PBP Events
  * @param  pNotification: pointer on notification information
 */
void PBP_Notification(PBP_Notification_Evt_t *pNotification)
{
  switch (pNotification->EvtOpcode)
  {
    case PBP_BROADCAST_AUDIO_UP_EVT:
      LOG_INFO_APP(">>== PBP_BROADCAST_AUDIO_UP_EVT\n");
      break;

    case PBP_BROADCAST_AUDIO_DOWN_EVT:
    {
      LOG_INFO_APP(">>== PBP_BROADCAST_AUDIO_DOWN_EVT\n");
      Stop_TxAudio();
      MX_AudioDeInit();
      PBPAPP_StopSink();
      PBPAPP_StartSink();
      break;
    }

    case PBP_PBK_BROADCAST_SOURCE_ADV_REPORT_EVT:
    {
      PBP_Broadcast_Source_Adv_Report_Data_t *data = (PBP_Broadcast_Source_Adv_Report_Data_t*) pNotification->pInfo;
      LOG_INFO_APP(">>== PBP_PBK_BROADCAST_SOURCE_ADV_REPORT_EVT\n");
      LOG_INFO_APP("     - Broadcasting Device with address %02X:%02X:%02X:%02X:%02X:%02X\n",
                  data->pBAPReport->pAdvAddress[5],
                  data->pBAPReport->pAdvAddress[4],
                  data->pBAPReport->pAdvAddress[3],
                  data->pBAPReport->pAdvAddress[2],
                  data->pBAPReport->pAdvAddress[1],
                  data->pBAPReport->pAdvAddress[0]);
      if (PBPAPP_Context.PASyncState == PBPAPP_PA_SYNC_STATE_IDLE
         && PBPAPP_Context.BIGSyncState == PBPAPP_BIG_SYNC_STATE_IDLE)
      {
        uint8_t parse_index = 0;
        char name[30] = "Unknown";
        char bid[12] = "ID:0x\0";
        const uint8_t* name_ptr = 0;
        uint8_t name_len = 0;

        while (parse_index + 3 < data->pBAPReport->AdvertisingDataLength)
        {
          /* First priority to the Broadcast Name */
          if (data->pBAPReport->pAdvertisingData[parse_index + 1] == 0x30)
          {
            name_ptr = &data->pBAPReport->pAdvertisingData[parse_index + 2];
            name_len = MIN(data->pBAPReport->pAdvertisingData[parse_index] - 1, 29);
            break;
          }
          /* Second priority to the Complete Local Name */
          else if (data->pBAPReport->pAdvertisingData[parse_index + 1] == AD_TYPE_COMPLETE_LOCAL_NAME)
          {
            name_ptr = &data->pBAPReport->pAdvertisingData[parse_index + 2];
            name_len = MIN(data->pBAPReport->pAdvertisingData[parse_index] - 1, 29);
          }
          /* Third priority to the Broadcast ID */
          else if (data->pBAPReport->pAdvertisingData[parse_index + 1] == AD_TYPE_SERVICE_DATA &&
              data->pBAPReport->pAdvertisingData[parse_index + 2] == 0x52 &&
              data->pBAPReport->pAdvertisingData[parse_index + 3] == 0x18)
          {
            sprintf(&bid[5],"%X", data->pBAPReport->pAdvertisingData[parse_index + 6]);
            sprintf(&bid[7],"%X", data->pBAPReport->pAdvertisingData[parse_index + 5]);
            sprintf(&bid[9],"%X",data->pBAPReport->pAdvertisingData[parse_index + 4]);
          }
          parse_index += data->pBAPReport->pAdvertisingData[parse_index] + 1;
        }

        if (name_ptr != 0)
        {
          UTIL_MEM_cpy_8(&name[0], name_ptr, name_len);
          name[name_len] = '\0';
        }
        else if (bid[5] != '\0')
        {
          UTIL_MEM_cpy_8(&name[0], bid, 11);
          name[11] = '\0';
        }

        if (strcmp(&name[0], aSourceList[CurrentID]) == 0)
        {
          /* Matching Name */
          uint8_t status;
          PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_SYNCHRONIZING;
          status = PBP_PBK_StartPASync(data->pBAPReport->AdvSID,
                                       data->pBAPReport->pAdvAddress,
                                       data->pBAPReport->AdvAddressType,
                                       PA_EVENT_SKIP,
                                       PA_SYNC_TIMEOUT);
          LOG_INFO_APP("==>> Starting Broadcasting DiscoveryDevice with Source %02X:%02X:%02X:%02X:%02X:%02X\n",
                            data->pBAPReport->pAdvAddress[5],
                            data->pBAPReport->pAdvAddress[4],
                            data->pBAPReport->pAdvAddress[3],
                            data->pBAPReport->pAdvAddress[2],
                            data->pBAPReport->pAdvAddress[1],
                            data->pBAPReport->pAdvAddress[0]);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : PBP_PBK_StartPASync() function, result: 0x%02X\n", status);
          }
          else
          {
            LOG_INFO_APP("  Success: PBP_PBK_StartPASync() function\n");
          }
          break;
        }
      }
      break;
    }

    case PBP_PBK_PA_SYNC_ESTABLISHED_EVT:
    {
      tBleStatus ret;

      LOG_INFO_APP(">>== PBP_PBK_PA_SYNC_ESTABLISHED_EVT\n");
      BAP_PA_Sync_Established_Data_t *data = (BAP_PA_Sync_Established_Data_t*) pNotification->pInfo;
      LOG_INFO_APP("     - Status : 0x%02x\n",pNotification->Status);
      LOG_INFO_APP("     - SyncHandle : 0x%02x\n",data->SyncHandle);
      PBPAPP_Context.PASyncHandle = data->SyncHandle;
      PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_SYNCHRONIZED;

      ret = PBP_PBK_StopAdvReportParsing();
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("  Fail   : PBP_PBK_StopAdvReportParsing() function, result: 0x%02X\n", ret);
      }
      else
      {
        LOG_INFO_APP("  Success: PBP_PBK_StopAdvReportParsing() function\n");
      }

      ret = aci_gap_terminate_gap_proc(GAP_OBSERVATION_PROC);
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("  Fail   : aci_gap_terminate_gap_proc() function, result: 0x%02X\n", ret);
      }
      else
      {
        PBPAPP_Context.ScanState = PBPAPP_SCAN_STATE_IDLE;
        LOG_INFO_APP("  Success: aci_gap_terminate_gap_proc() function\n");
      }
      break;
    }

    case PBP_PBK_PA_SYNC_LOST_EVT:
      LOG_INFO_APP(">>== PBP_PBK_PA_SYNC_LOST_EVT\n");
      PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_IDLE;
      break;

    case PBP_PBK_BASE_REPORT_EVT:
    {
      BAP_BASE_Report_Data_t *base_data;
      uint8_t status;
      uint8_t index = 0;
      uint8_t i;
      uint8_t j;
      uint8_t k;
      uint8_t l;
      uint8_t is_different;
      uint8_t payload_len = 0;
      LOG_INFO_APP(">>== PBP_PBK_BASE_REPORT_EVT\n");

