STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/pbp_app.c
      base_data = (BAP_BASE_Report_Data_t*) pNotification->pInfo;
      if (PBPAPP_Context.PASyncState == PBPAPP_PA_SYNC_STATE_SYNCHRONIZED)
      {
        PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_BASE_RECEIVED;
        /* First BASE report after PA sync, force the parsing */
        is_different = 0x01u;
      }
      else
      {
        is_different = CAP_Broadcast_IsBASEGroupDifferent(base_data->pBasePayload,
                                              base_data->BasePayloadLength,
                                              &(PBPAPP_Context.base_group),
                                              &(index));
      }
      if (is_different == 0x00u)
      {
        payload_len += index;
        for (i = 0; i < PBPAPP_Context.base_group.NumSubgroups && is_different == 0x00u; i++)
        {
          is_different = CAP_Broadcast_IsBASESubgroupDifferent(base_data->pBasePayload + payload_len,
                                                    base_data->BasePayloadLength - payload_len,
                                                    &(PBPAPP_Context.base_subgroups[i]),
                                                    &(index));
          payload_len += index;
          for (j = 0; (j < PBPAPP_Context.base_subgroups[i].NumBISes && is_different == 0x00u); j++)
          {
            is_different = CAP_Broadcast_IsBASEBISDifferent(base_data->pBasePayload + payload_len,
                                                          base_data->BasePayloadLength - payload_len,
                                                          &(PBPAPP_Context.base_bis[j]),
                                                          &(index));
            payload_len += index;
          }
        }
      }
      if (is_different == 0x00u)
      {
        /* BASE report is not different from the one in PBPAPP_Context */
        /* No need to parse, copy, or log it again*/
        break;
      }
      status = CAP_Broadcast_ParseBASEGroup(base_data->pBasePayload,
                                            base_data->BasePayloadLength,
                                            &(PBPAPP_Context.base_group),
                                            &(index));

      if (status == BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("==>> Start BAP BSNK Parse BASE Group INFO\n");
        LOG_INFO_APP("   Payload Len role : 0x%02x\n",base_data->BasePayloadLength);
        LOG_INFO_APP("   Presentation_delay: 0x%08x\n",PBPAPP_Context.base_group.PresentationDelay);
        LOG_INFO_APP("   Num_subgroups : 0x%02x\n",PBPAPP_Context.base_group.NumSubgroups);
        base_data->pBasePayload += index;
        base_data->BasePayloadLength -= index;

        /* Parse Subgroups */
        for (i = 0; i < PBPAPP_Context.base_group.NumSubgroups && status == BLE_STATUS_SUCCESS; i++)
        {
          status = CAP_Broadcast_ParseBASESubgroup(base_data->pBasePayload,
                                                    base_data->BasePayloadLength,
                                                    &(PBPAPP_Context.base_subgroups[i]),
                                                    &(index));
          base_data->pBasePayload += index;
          base_data->BasePayloadLength -= index;

          LOG_INFO_APP("    BAP_BSNK_ParseBASESubgroup INFO Number :%d\n", i);
          LOG_INFO_APP("    Codec ID : 0x%08x\n",PBPAPP_Context.base_subgroups[i].CodecID);
          LOG_INFO_APP("    Codec specific config length : %d bytes\n",
                      PBPAPP_Context.base_subgroups[i].CodecSpecificConfLength);
          if (PBPAPP_Context.base_subgroups[i].CodecSpecificConfLength > 0u)
          {
            for (k = 0;k<PBPAPP_Context.base_subgroups[i].CodecSpecificConfLength;k++)
            {
              if (PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k] > 0u)
              {
                LOG_INFO_APP("      Length: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k]);
                LOG_INFO_APP("        Type: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k+1u]);
                LOG_INFO_APP("        Value: 0x");
                for (l = 0 ;l<(PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k]-1);l++)
                {
                  LOG_INFO_APP("%02x",PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k+2u+l]);
                }
                LOG_INFO_APP("\n");
              }
              k+=PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k];
            }
          }
          LOG_INFO_APP("    Metadata length : %d bytes\n",PBPAPP_Context.base_subgroups[i].MetadataLength);
          if (PBPAPP_Context.base_subgroups[i].MetadataLength > 0)
          {
            for (k = 0;k<PBPAPP_Context.base_subgroups[i].MetadataLength;k++)
            {
              if (PBPAPP_Context.base_subgroups[i].pMetadata[k] > 0u)
              {
                LOG_INFO_APP("      Length: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pMetadata[k]);
                LOG_INFO_APP("        Type: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pMetadata[k+1u]);
                LOG_INFO_APP("        Value: 0x");
                for (l = 0 ;l<(PBPAPP_Context.base_subgroups[i].pMetadata[k]-1);l++)
                {
                  LOG_INFO_APP("%02x",PBPAPP_Context.base_subgroups[i].pMetadata[k+2u+l]);
                }
                LOG_INFO_APP("\n");
              }
              k+=PBPAPP_Context.base_subgroups[i].pMetadata[k];
            }
          }
          LOG_INFO_APP("    Num_BIS : %d\n",PBPAPP_Context.base_subgroups[i].NumBISes);

          /* Parse BIS */
          for (j = 0; (j < PBPAPP_Context.base_subgroups[i].NumBISes) && (status == BLE_STATUS_SUCCESS); j++)
          {
            status = CAP_Broadcast_ParseBASEBIS(base_data->pBasePayload,
                                                base_data->BasePayloadLength,
                                                &(PBPAPP_Context.base_bis[j]),
                                                &(index));
            base_data->pBasePayload += index;
            base_data->BasePayloadLength -= index;

            LOG_INFO_APP("      BIS INDEX : 0x%02x\n",PBPAPP_Context.base_bis[j].BIS_Index);
            LOG_INFO_APP("      Codec specific config length : %d bytes\n",PBPAPP_Context.base_bis[j].CodecSpecificConfLength);
            if (PBPAPP_Context.base_bis[j].CodecSpecificConfLength > 0u)
            {
              for (int k = 0;k<PBPAPP_Context.base_bis[j].CodecSpecificConfLength;k++)
              {
                if (PBPAPP_Context.base_bis[j].pCodecSpecificConf[k] > 0u)
                {
                  LOG_INFO_APP("        Length: 0x%02x\n",PBPAPP_Context.base_bis[j].pCodecSpecificConf[k]);
                  LOG_INFO_APP("          Type: 0x%02x\n",PBPAPP_Context.base_bis[j].pCodecSpecificConf[k+1u]);
                  LOG_INFO_APP("          Value: 0x");
                  for (int l = 0 ;l<(PBPAPP_Context.base_bis[j].pCodecSpecificConf[k]-1);l++)
                  {
                    LOG_INFO_APP("%02x",PBPAPP_Context.base_bis[j].pCodecSpecificConf[k+2u+l]);
                  }
                  LOG_INFO_APP("\n");
                }
                k+=PBPAPP_Context.base_bis[j].pCodecSpecificConf[k];
              }
            }
          }
        }
        LOG_INFO_APP("==>> End Start BAP BSNK Parse BASE Group INFO\n");

