STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/pbp_app.c
void APP_NotifyRxAudioCplt(uint16_t AudioFrameSize)
{
  UNUSED(AudioFrameSize);
}

void APP_NotifyRxAudioHalfCplt(void)
{

}

void APP_NotifyTxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_ReceiveData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aSnkBuff[0]  + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyTxAudioHalfCplt(void)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SINK)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_ReceiveData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aSnkBuff[0] + i);
    }
  }
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/**
  * @brief  Notify CAP Events for App
  * @param  pNotification: pointer on notification information
 */
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification)
{
  switch (pNotification->EvtOpcode)
  {
    case CAP_AUDIO_CLOCK_REQ_EVT:
    {
      LOG_INFO_APP(">>== CAP_AUDIO_CLOCK_REQ_EVT\n");
      Sampling_Freq_t *freq = (Sampling_Freq_t *)pNotification->pInfo;
      LOG_INFO_APP("     - Sample Frequency Type:   0x%02X\n",*freq);
      LOG_INFO_APP("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",*freq);
      AudioClock_Init(*freq);
      break;
    }

    default:
      break;
  }
}

static uint8_t PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role)
{
  tBleStatus ret = 0;

  /*Clear the CAP Configuration*/
  memset(&PBPAPP_CAP_Config,0,sizeof(PBPAPP_CAP_Config));

  /*Clear the BAP Configuration*/
  memset(&PBPAPP_BAP_Config,0,sizeof(PBPAPP_BAP_Config));

  /*Clear the CCP Configuration*/
  memset(&PBPAPP_CCP_Config,0,sizeof(CCP_Config_t));

  /*Clear the MCP Configuration*/
  memset(&PBPAPP_MCP_Config,0,sizeof(MCP_Config_t));

  /*Clear the VCP Configuration*/
  memset(&PBPAPP_VCP_Config,0,sizeof(VCP_Config_t));

  /*Clear the MICP Configuration*/
  memset(&PBPAPP_MICP_Config,0,sizeof(MICP_Config_t));

  /*Clear the CSIP Configuration*/
  memset(&PBPAPP_CSIP_Config,0,sizeof(CSIP_Config_t));

  PBPAPP_CAP_Config.Role = CAP_Role;
  PBPAPP_CAP_Config.MaxNumLinks = CFG_BLE_NUM_LINK;

  PBPAPP_CAP_Config.pStartRamAddr = (uint8_t *)&aCAPMemBuffer;
  PBPAPP_CAP_Config.RamSize = CAP_DYN_ALLOC_SIZE;

  PBPAPP_BAP_Config.Role = BAP_Role;

  PBPAPP_BAP_Config.MaxNumBleLinks = CFG_BLE_NUM_LINK;

  if ((PBPAPP_BAP_Config.Role & BAP_ROLE_BROADCAST_SINK) == BAP_ROLE_BROADCAST_SINK)
  {
    /*Published Audio Capabilities of Unicast Server and Broadcast Sink Configuration*/
    PBPAPP_BAP_Config.PACSSrvConfig.MaxNumSnkPACRecords = MAX_NUM_PAC_SNK_RECORDS;
    PBPAPP_BAP_Config.PACSSrvConfig.MaxNumSrcPACRecords = MAX_NUM_PAC_SRC_RECORDS;
    PBPAPP_BAP_Config.PACSSrvConfig.pStartRamAddr = (uint8_t *)&aPACSSrvMemBuffer;
    PBPAPP_BAP_Config.PACSSrvConfig.RamSize = BAP_PACS_SRV_DYN_ALLOC_SIZE;
  }

  if ((PBPAPP_BAP_Config.Role & BAP_ROLE_SCAN_DELEGATOR) == BAP_ROLE_SCAN_DELEGATOR)
  {
    /*Broadcast Audio Scan for Scan Delegator Configuration*/
    PBPAPP_BAP_Config.BASSSrvConfig.MaxNumBSRC = MAX_NUM_SDE_BSRC_INFO;
    PBPAPP_BAP_Config.BASSSrvConfig.MaxCodecConfSize = MAX_BASS_CODEC_CONFIG_SIZE;
    PBPAPP_BAP_Config.BASSSrvConfig.MaxMetadataLength = MAX_BASS_METADATA_SIZE;
    PBPAPP_BAP_Config.BASSSrvConfig.MaxNumBaseSubgroups = MAX_NUM_BASS_BASE_SUBGROUPS;
    PBPAPP_BAP_Config.BASSSrvConfig.pStartRamAddr = (uint8_t *)&aBASSSrvMemBuffer;
    PBPAPP_BAP_Config.BASSSrvConfig.RamSize = BAP_BASS_SRV_DYN_ALLOC_SIZE;
  }

  if (((PBPAPP_BAP_Config.Role & BAP_ROLE_SCAN_DELEGATOR) == BAP_ROLE_SCAN_DELEGATOR)
   || ((PBPAPP_BAP_Config.Role & BAP_ROLE_BROADCAST_SINK) == BAP_ROLE_BROADCAST_SINK))
  {
    /* BASE structure for fragmented PA reports */
    PBPAPP_BAP_Config.BASEStrConfig.pStartRamAddr = (uint8_t *)&aBASEMemBuffer;
    PBPAPP_BAP_Config.BASEStrConfig.RamSize = BAP_BASE_TOTAL_BUFFER_SIZE;
  }

  /*Isochronous Channels Configuration*/
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCIG = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCISPerCIG = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBIG = MAX_NUM_BIG;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBISPerBIG = MAX_NUM_BIS_PER_BIG;
  PBPAPP_BAP_Config.ISOChnlConfig.pStartRamAddr = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.RamSize = 0u;

  if (((PBPAPP_BAP_Config.Role & BAP_ROLE_BROADCAST_ASSISTANT) == BAP_ROLE_BROADCAST_ASSISTANT)\
    || ((PBPAPP_BAP_Config.Role & BAP_ROLE_SCAN_DELEGATOR) == BAP_ROLE_SCAN_DELEGATOR))
  {
    /* Non-Volatile Memory Management for BAP Services restoration */
    PBPAPP_BAP_Config.NvmMgmtConfig.pStartRamAddr = (uint8_t *)&aNvmMgmtMemBuffer;
    PBPAPP_BAP_Config.NvmMgmtConfig.RamSize = BAP_NVM_MGMT_DYN_ALLOC_SIZE;
  }

  /* Initialize the Basic Audio Profile*/
  ret = CAP_Init(&PBPAPP_CAP_Config,
                 &PBPAPP_BAP_Config,
                 &PBPAPP_VCP_Config,
                 &PBPAPP_MICP_Config,
                 &PBPAPP_CCP_Config,
                 &PBPAPP_MCP_Config,
                 &PBPAPP_CSIP_Config);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_Init() function\n");
  }
  if (ret == BLE_STATUS_SUCCESS)
  {

    /*Initialize the Audio Codec (LC3)*/
    CODEC_LC3Config_t lc3_config = {0};
    PBPAPP_Context.bap_role = PBPAPP_BAP_Config.Role;

    /*Register the Audio Task */
    UTIL_SEQ_RegTask( 1<<CFG_TASK_AUDIO_ID, UTIL_SEQ_RFU, BLE_AUDIO_STACK_Task);

    lc3_config.SessionSize = sizeof(aLC3SessionMemBuffer);
    lc3_config.ChannelSize = sizeof(aLC3ChannelMemBuffer);
    lc3_config.StackSize = sizeof(aLC3StackMemBuffer);

    lc3_config.pSessionStart = aLC3SessionMemBuffer;
    lc3_config.pChannelStart = aLC3ChannelMemBuffer;
    lc3_config.pStackStart = aLC3StackMemBuffer;

    CODEC_ManagerInit(sizeof(aCodecPacketsMemory),
                      (uint8_t*)aCodecPacketsMemory,
                      &lc3_config,
                      CODEC_PROC_MARGIN_US,
                      CODEC_RF_SETUP_US,
                      CODEC_MODE_DEFAULT);
    PBPAPP_Context.base_group.pSubgroups = &(PBPAPP_Context.base_subgroups[0]);
    PBPAPP_Context.base_subgroups[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[0][0]);
    PBPAPP_Context.base_subgroups[0].pMetadata = &(PBPAPP_Context.subgroup_metadata[0][0]);
    PBPAPP_Context.base_subgroups[0].pBIS = &(PBPAPP_Context.base_bis[0]);
    PBPAPP_Context.base_subgroups[1].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[1][0]);
    PBPAPP_Context.base_subgroups[1].pMetadata = &(PBPAPP_Context.subgroup_metadata[1][0]);
    PBPAPP_Context.base_subgroups[1].pBIS = &(PBPAPP_Context.base_bis[1]);
    PBPAPP_Context.base_bis[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[0][0]);
    PBPAPP_Context.base_bis[1].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[1][0]);
  }
  return ret;
}

static void PBPAPP_StartBroadcastAudio(Audio_Role_t role)
{
  if (role == AUDIO_ROLE_SINK)
  {
    CODEC_RegisterTriggerClbk(DATA_PATH_SAMPLE_CIRC_BUF, DATA_PATH_OUTPUT, &start_audio_sink);
  }
}

